
#[test]

fn main() {
    let (x, y);
    (x,..) = (3, 4);
    [.., y] = [1, 2];
    // Fill the blank to make the code work
    assert_eq!([x,y], [3,2]);

    println!("Success!");
}


//У цьому коді використовується розпакування (деструктуризація) кортежів і масивів для присвоєння значень змінним x та y. Ось як це працює:
// (x, ..) = (3, 4); присвоює значення 3 змінній x.
// [.., y] = [1, 2]; присвоює значення 2 змінній y.
// Щоб код працював, потрібно заповнити пропуск в асертації значеннями [3, 2], оскільки змінні x та y отримують саме ці значення.